In [1]:
#Step 1) Importing necessary libtraries for algorithm
import pandas as pd #for creating dataframe and analysis purpose
import numpy as np  #for number operations
import seaborn as sns #for visualization
import matplotlib.pyplot as plt #for visualization
from sklearn.model_selection import train_test_split #for splitting IV and DV
from sklearn.preprocessing import StandardScaler # Scaling
from sklearn.neighbors import KNeighborsClassifier # Algorithm
from sklearn.metrics import accuracy_score # Evaluation

In [47]:
#FOR LOGISTICS REGRESSION MODEL:
#Step2: Importing the dataset:
titanic_df=pd.read_csv(r"E:\Data_Analysis\Titanic-Copy1.csv")
titanic_df.head(10)

,Unnamed: 0,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450
5,5,NaN,NaN,Q,8.4583,"Moran, Mr. James",0,6,3,male,0,0.0,330877
6,6,54.0,E46,S,51.8625,"McCarthy, Mr. Timothy J",0,7,1,male,0,0.0,17463
7,7,2.0,NaN,S,21.0750,"Palsson, Master. Gosta Leonard",1,8,3,male,3,0.0,349909
8,8,27.0,NaN,S,11.1333,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",2,9,3,female,0,1.0,347742
9,9,14.0,NaN,C,30.0708,"Nasser, Mrs. Nicholas (Adele Achem)",0,10,2,female,1,1.0,237736

In [48]:
titanic_df1=titanic_df.copy()
titanic_df1.head(10)

,Unnamed: 0,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450
5,5,NaN,NaN,Q,8.4583,"Moran, Mr. James",0,6,3,male,0,0.0,330877
6,6,54.0,E46,S,51.8625,"McCarthy, Mr. Timothy J",0,7,1,male,0,0.0,17463
7,7,2.0,NaN,S,21.0750,"Palsson, Master. Gosta Leonard",1,8,3,male,3,0.0,349909
8,8,27.0,NaN,S,11.1333,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",2,9,3,female,0,1.0,347742
9,9,14.0,NaN,C,30.0708,"Nasser, Mrs. Nicholas (Adele Achem)",0,10,2,female,1,1.0,237736

In [49]:
#Step 3) Analysis and Pre processing:
# In the above dataset, checking for any anomoloies like missing value, string data etc and also choosing significant columns
titanic_df1.drop("Unnamed: 0",inplace=True, axis=1)

In [50]:
titanic_df1.head(10)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450
5,NaN,NaN,Q,8.4583,"Moran, Mr. James",0,6,3,male,0,0.0,330877
6,54.0,E46,S,51.8625,"McCarthy, Mr. Timothy J",0,7,1,male,0,0.0,17463
7,2.0,NaN,S,21.0750,"Palsson, Master. Gosta Leonard",1,8,3,male,3,0.0,349909
8,27.0,NaN,S,11.1333,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",2,9,3,female,0,1.0,347742
9,14.0,NaN,C,30.0708,"Nasser, Mrs. Nicholas (Adele Achem)",0,10,2,female,1,1.0,237736

In [51]:
#Here, ticket, Cabin,parch, name,sibsp are unique in nature,so we can drop that columns too, this step is for selecting significant variables
titanic_df1.drop(["Cabin","Name","Parch","SibSp","Ticket"],inplace=True, axis=1)

In [52]:
titanic_df1.head(10)

    Age Embarked     Fare  PassengerId  Pclass     Sex  Survived
0  22.0        S   7.2500            1       3    male       0.0
1  38.0        C  71.2833            2       1  female       1.0
2  26.0        S   7.9250            3       3  female       1.0
3  35.0        S  53.1000            4       1  female       1.0
4  35.0        S   8.0500            5       3    male       0.0
5   NaN        Q   8.4583            6       3    male       0.0
6  54.0        S  51.8625            7       1    male       0.0
7   2.0        S  21.0750            8       3    male       0.0
8  27.0        S  11.1333            9       3  female       1.0
9  14.0        C  30.0708           10       2  female       1.0

In [53]:
titanic_df1.isnull().sum()

Age            263
Embarked         2
Fare             1
PassengerId      0
Pclass           0
Sex              0
Survived       418
dtype: int64

In [54]:
#Step1) Treating the missing values, i) Survived:
titanic_df1["Survived"].unique()

array([ 0.,  1., nan])

In [55]:
titanic_df1["Survived"].value_counts()

0.0    549
1.0    342
Name: Survived, dtype: int64

In [56]:
#here,forward filled is used for filling the missing values
titanic_df1["Survived"].fillna(method='bfill',inplace=True)

In [57]:
titanic_df1["Age"]

0       22.0
1       38.0
2       26.0
3       35.0
4       35.0
        ...
1304     NaN
1305    39.0
1306    38.5
1307     NaN
1308     NaN
Name: Age, Length: 1309, dtype: float64

In [58]:
titanic_df1.isna().sum()

Age            263
Embarked         2
Fare             1
PassengerId      0
Pclass           0
Sex              0
Survived       418
dtype: int64

In [59]:
titanic_df1.fillna(titanic_df1.mean(),inplace = True)  #Since the data set is in continuous in nature, we can use mean method to fill na

C:\Users\NVPC\AppData\Local\Temp/ipykernel_3204/1944959455.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  titanic_df1.fillna(titanic_df1.mean(),inplace = True)

In [60]:
titanic_df1["Embarked"].value_counts()

S    914
C    270
Q    123
Name: Embarked, dtype: int64

In [61]:
#Since data is in string categorical in nature, using the most repeated value in the place of na
titanic_df1["Embarked"].fillna("S", inplace=True)

In [62]:
titanic_df1.isna().sum()  #no missing value

Age            0
Embarked       0
Fare           0
PassengerId    0
Pclass         0
Sex            0
Survived       0
dtype: int64

In [63]:
titanic_df1.dtypes

Age            float64
Embarked        object
Fare           float64
PassengerId      int64
Pclass           int64
Sex             object
Survived       float64
dtype: object

In [64]:
#to convert all the object to number format
titanic_df1["Embarked"]=titanic_df1["Embarked"].astype("category")

In [66]:
titanic_df1["Embarked"]=titanic_df1["Embarked"].cat.codes

In [68]:
titanic_df1["Sex"]=titanic_df1["Sex"].astype("category")

In [69]:
titanic_df1["Sex"]=titanic_df1["Sex"].cat.codes

In [70]:
titanic_df1.dtypes

Age            float64
Embarked          int8
Fare           float64
PassengerId      int64
Pclass           int64
Sex               int8
Survived       float64
dtype: object

In [83]:
#now convert the float value into int, by
titanic_df1["Survived"]=titanic_df1["Survived"].astype('int')

In [84]:
#now all the anomolies like missing and str are cleared and also, most significant columns are chosen. Now the model.
#Step 4) Splitting IV and DV: Independent and Dependent variable
X=titanic_df1.drop("Survived",axis=1)
print(X)

      Age  Embarked      Fare  PassengerId  Pclass  Sex
0      22         2    7.2500            1       3    1
1      38         0   71.2833            2       1    0
2      26         2    7.9250            3       3    0
3      35         2   53.1000            4       1    0
4      35         2    8.0500            5       3    1
...   ...       ...       ...          ...     ...  ...
1304   29         2    8.0500         1305       3    1
1305   39         0  108.9000         1306       1    0
1306   38         2    7.2500         1307       3    1
1307   29         2    8.0500         1308       3    1
1308   29         0   22.3583         1309       3    1

[1309 rows x 6 columns]

In [85]:
Y=titanic_df1["Survived"]
print(Y)

0       0
1       1
2       1
3       1
4       0
       ..
1304    0
1305    0
1306    0
1307    0
1308    0
Name: Survived, Length: 1309, dtype: int32

In [86]:
#Step 5) Assumptions:
# 1.Should have more number of data, number of the data 1308, so 1st Assumption satisifed
titanic_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Age          1309 non-null   int32
 1   Embarked     1309 non-null   int8
 2   Fare         1309 non-null   float64
 3   PassengerId  1309 non-null   int64
 4   Pclass       1309 non-null   int64
 5   Sex          1309 non-null   int8
 6   Survived     1309 non-null   int32
dtypes: float64(1), int32(2), int64(2), int8(2)
memory usage: 43.6 KB

In [87]:
# 2.No Multicollinearity
titanic_df1.corr()    #Here, no values are greater than the 0.75, so Multicollinearity assumption is satisfied.

,Age,Embarked,Fare,PassengerId,Pclass,Sex,Survived
Age,1.000000,-0.067159,0.175114,0.025566,-0.372115,0.055101,-0.058034
Embarked,-0.067159,1.000000,-0.237970,-0.051977,0.185479,0.097960,-0.091394
Fare,0.175114,-0.237970,1.000000,0.031416,-0.558477,-0.185484,0.173630
PassengerId,0.025566,-0.051977,0.031416,1.000000,-0.038354,0.013406,-0.331493
Pclass,-0.372115,0.185479,-0.558477,-0.038354,1.000000,0.124617,-0.244686
Sex,0.055101,0.097960,-0.185484,0.013406,0.124617,1.000000,-0.404020
Survived,-0.058034,-0.091394,0.173630,-0.331493,-0.244686,-0.404020,1.000000

In [114]:
#Scaling the Data (Normalize):
train=np.array(Y_train)
train.shape

(1, 1, 1112)

In [119]:
Y_train=train.reshape(1,-1)
print(Y_train)

[[1 0 0 ... 0 0 1]]

In [120]:
test=np.array(Y_test)
test.shape

(197,)

In [121]:
Y_test=test.reshape(1,-1)
print(Y_test)

[[1 0 0 0 0 1 0 0 0 1 0 0 1 0 0 0 0 1 0 1 0 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0
  1 1 1 0 1 0 0 0 0 0 0 0 1 0 1 1 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 0 0 0
  0 1 1 1 0 0 0 0 0 0 1 1 1 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0
  0 1 0 0 0 0 0 0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1
  0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 1 1 0 1 1 0 0 0 0 0 0 1 0 0 0 0
  0 0 0 0 0 0 0 0 0 0 0 1 0 0 1 1 0]]

In [122]:
scale = StandardScaler()
X_train = scale.fit_transform(X_train)
X_test = scale.fit_transform(X_test)
Y_train = scale.fit_transform(Y_train)
Y_test = scale.fit_transform(Y_test)

In [123]:
#Step 6) Split Train and test Data and calling the model to perform
X_train, X_test, Y_train, Y_test=train_test_split(X,Y,test_size=0.15,random_state=50)  #Splitting Train and test data
from sklearn.linear_model import LogisticRegression  #Forgot to add the library in the beginning, 
model=LogisticRegression()  #Calling the model
model.fit(X_train,Y_train)  #fitting the train and test data
predictions=model.predict(X_test)  #predicting the data and save it to an variable
print(predictions)

[1 0 1 0 0 1 0 0 0 1 0 0 1 0 0 0 0 1 0 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 1
 1 1 0 0 0 1 0 0 0 0 0 1 0 1 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 0
 1 0 0 0 0 0 0 0 0 1 1 0 0 0 1 0 0 0 0 0 0 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 1
 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 1 0 0 1 1 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0
 0 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0 1 1 0 1 1 0 0 0 1 0 0 1 1 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 1 0 1 1 0]

D:\Anaconda\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

In [124]:
#Step 7) Evaluation:
from sklearn.metrics import accuracy_score
accuracy_score(Y_test, predictions)

0.8730964467005076

In [ ]:
#Accuracy Score for Logistics model is 87.3096%

In [132]:
# FOR K NEARESET NEIGHBOUR MODEL(KNN):
#Since all the preprocessing done, calling the model. 
len(Y_test)  #To know the n_neighbour or k value,choosing K value, K=15 since K is 14, taking odd value
classifier_model = KNeighborsClassifier(n_neighbors = 15,  metric='euclidean')  #Calling the model
classifier_model.fit(X_train,Y_train)  #Fitting the data
predictions= classifier_model.predict(X_test) #Predicting the data
print(predictions)

[1 0 0 0 0 1 0 0 0 0 0 0 0 0 1 0 0 0 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1
 0 0 0 1 0 0 1 0 0 1 1 1 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 1 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 1 0
 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0
 1 0 0 0 0 0 0 1 0 0 0 0]

In [131]:
# Evaluation:
from sklearn.metrics import accuracy_score
accuracy_score(Y_test, predictions)

0.8071065989847716

In [ ]:
#Accuracy Score for using the KNN model is 80.203%, since the data set is little larger, that may caused that model accuracy low.

In [ ]:
#From both model, it is interpreted that logistics model outperfom the KNN model with the accuracy score of 87.309%